export default {
  courseTitle: { mainTitle: " IoT / 인공지능" },
  courseSubTitle: "AWS를 활용한 IoT 서비스 개발자 양성과정",
  courseIntroduction: [
    "본 과정은 4차산업혁명 시대의 인재양성을 위하여 기존 빅데이터를 다루는 훈련과정과는 달리 빅데이터 분석과 클라우드 아키텍처를 활용할 수 있는 능력을 융합하여 학습용 기술이 아닌 실무에서 사용 가능한 기술을 적용할 수 있도록 지도한다. 또한 기술습득뿐만 아니라 전체 비즈니스 모델을 이해함으로써 취업 뿐만 아니라 창업까지 가능한 수준의 프로젝트 결과가 수행될 수 있도록 지도한다",
  ],
  courseFeatures: [
    "4차 산업혁명 시대에 맞는 기본 프로그래밍과 IoT, 인공지능 등 개발능력을 습득할 수 있도록 알찬 교육과정 구성",
    "IoT, 인공지능 분야 관련 신입개발자로서 현업에서 바로 역량을 발휘할 수 있는 실습 위주의 교육과정 구성",
    "과정별 전담 매니저를 통한 비트교육센터 특유의 체계적인 운영/관리 프로그램 ",
    "기업 연계형 프로젝트 수행으로 실무능력 향상",
    "비트교육센터 고유의 특화된 취업시스템으로 수료생 취업 연계 및 관리",
  ],
  coursePrivilege: [
    "매월 훈련수당 지급(최대 400,000원)",
    "PC, 교재, 실습장비, 프로젝트 개발 비용 지원",
    "SW 관련 민간공인 자격증 취득(BSPM, 비트SW프로젝트 2급)",
  ],
  courseTarget: [
    {
      descriptionTitle: null,
      descriptionContents: ["만34세이하 청년구직자(비전공자 지원가능)"],
    },
  ],
  courseSchedules: {
    term: "2020년 9월 14일 ~ 2021년 3월 18일",
    courseScheduleTime: [
      {
        time: "09:00 ~ 18:00",
        courseCost: [
          {
            cost: "0원",
            educationMethods: "오프라인",
          },
        ],
      },
    ],
  },
  courseDetailInformation: [
    {
      educationMethod: "오프라인\n(대면강의)",
      educationMethodDetail: [
        "비트교육센터 강의장에서 강의 진행",
        "서울시 서초구 서초대로 74길 33, 비트빌딩",
      ],
    },
  ],
  courseContents: [
    { contentsTitle: "  [1단계] : 프로그래밍 능력 및 문제해결 능력 배양" },
    {
      day: "Python 프로그래밍",
      contents: [
        "Python 자료형과 연산자",
        "Python 활용(파일, 함수, 모듈, 패키지)",
        "Python 데이터베이스 프로그래밍",
      ],
    },
    
    {
      day: "C 프로그래밍",
      contents: [
        "환경설정 및 상수와 변수, 연산자",
        "데이터 표현 방식, 조건문, 반복문",
        "포인터와 배열, 구조체",
      ],
    },
    {
      day: "알고리즘 이해와 구현",
      contents: [
        "기본적인 자료와 알고리즘, 트리",
        "기본 정렬 알고리즘",
        "향상된 정렬 알고리즘",
        "실전 알고리즘 문제 해결",
      ],
    },
    {
      contentsTitle:
        "[2단계] : IoT 서비스를 위한 프로그래밍 (with AWS)",
    },
    {
      day: "AI와 사물인터넷 개론",
      contents: [
        "컴퓨터 공헉과 인터넷의 역사",
        "오픈 소프트웨어/오픈 하드웨어",
        "IoT(사물인터넷)과 임베디드의 관계",
        "새로운 컴퓨팅 기술",
      ],
    },
    {
      day: "리눅스 시스템 관리",
      contents: [
        "리눅스 소개 및 환경구축",
        "리눅스 기본 명령어",
        "리눅스 에디터 환경 구축",
        "네트워크 환경의 이해",
      ],
    },
    {
      day: "IoT 서비스를 위한 시스템/네트워크 프로그래밍",
      contents: [
        "라즈베리파이 이해 및 구현",
        "시스템 프로그래밍의 개념",
        "파일 I/O, 프로세스, 메모리",
        "TCP/UDP 서버/클라이언트",
      ],
    },
    {
      day: "AWS를 활용한 IoT 서비스 구현",
      contents: [
        "AWS IoT의 이해, SDK 사용하기 (with 라즈베리파이)",
        "AWS IoT에서의 디바이스 관리",
        "디바이스 연결",
      ],
    },
    {
      day: "미니프로젝트Ⅰ",
      contents: ["AWS를 활용한 IoT 센서 모니터링 서비스 구현"],
    },
    
    { contentsTitle: "[3단계] 영상인식을 위한 딥러닝의 이해와 구현" },
    {
      day: "파이썬을 활용한 영상처리",
      contents: [
        "OpenCV 소개, Numpy, Matplotlib, OpenCV환경구축",
        "영상 및 비디오 입출력",
        "OpenCV기본 연산 및 임계값고 히스토그램 처리",
        "영상공간 필터링",
      ],
    },
    {
      day: "파이썬을 활용한 GUI 프로그래밍",
      contents: [
        "PyQT5 기초, 레이아웃",
        "PyQT5 위젯, 다이얼로그",
        "PyQT5 시그널과 슬롯",
        
      ],
    },
    {
      day: "딥러닝 기초 및 데이터 사이언스",
      contents: [
        "인공지능의 역사와 현재",
        "인공지능/머신러닝/딥러닝",
        "신경망의 필수 함수",
      ],
    },
    {
      day: "텐서플로우 기반 딥러닝",
      contents: [
        "텐서플로우 소개 및 환경설정",
        "텐서플로우 기초와 텐서보드",
        "인공신경망(ANN), 오토인코더",
      ],
    },
    {
      day: "딥러닝을 활용한 영상인식",
      contents: [
        "Object Detection이란?",
        "R-CNN이란?",
        "딥러닝을 위한 데이터셋",
        "최근 영상인식 관련 논문 분석",
      ],
    },
    {
      day: "미니프로젝트Ⅱ",
      contents: ["AI 스캐너 구현 프로젝트"],
    },
   
   
    { contentsTitle: "[4단계] : 실무 프로젝트 구현" },
    {
      day: "실무 프로젝트",
      contents: [
        "4인 내외로 팀 구성",
        "주제 선정 후, 3개월 동안 프로젝트 수행, 개발 완료",
        "외부업체 관계자들의 참관 하에 최종 전시회 진행",
      ],
    },
  ],

  courseGuide: ["문의 : 비트교육센터 Tel. 02-3486-1780"],
  formUrl: "https://forms.gle/p9aryS47epdwzaH1A",
};
