export default {
  courseTitle: { mainTitle: "빅데이터 / 인공지능" },
  courseSubTitle: "빅데이터 분석을 활용한 예측&인공지능(AI)모델링",
  courseIntroduction: [
    "본 과정은 4차산업혁명 시대의 인재양성을 위하여 기존 빅데이터를 다루는 훈련과정과는 달리 빅데이터 분석과 클라우드 아키텍처를 활용할 수 있는 능력을 융합하여 학습용 기술이 아닌 실무에서 사용 가능한 기술을 적용할 수 있도록 지도한다. 또한 기술습득뿐만 아니라 전체 비즈니스 모델을 이해함으로써 취업 뿐만 아니라 창업까지 가능한 수준의 프로젝트 결과가 수행될 수 있도록 지도한다",
  ],
  courseFeatures: [
    "4차 산업혁명 시대에 맞는 기본 프로그래밍과 빅데이터 등 개발능력을 습득할 수 있도록 알찬 교육과정 구성",
    "빅데이터, 인공지능 분야 관련 신입개발자로서 현업에서 바로 역량을 발휘할 수 있는 실습 위주의 교육과정 구성",
    "과정별 전담 매니저를 통한 비트교육센터 특유의 체계적인 운영/관리 프로그램 ",
    "기업 연계형 프로젝트 수행으로 실무능력 향상",
    "비트교육센터 고유의 특화된 취업시스템으로 수료생 취업 연계 및 관리",
  ],
  coursePrivilege: [
    "매월 훈련수당 지급(최대 400,000원)",
    "PC, 교재, 실습장비, 프로젝트 개발 비용 지원",
    "SW 관련 민간공인 자격증 취득(BSPM, 비트SW프로젝트 2급)",
  ],
  courseTarget: [
    {
      descriptionTitle: null,
      descriptionContents: ["만34세이하 청년구직자(비전공자 지원가능)"],
    },
  ],
  courseSchedules: {
    term: "2020년 8월 10일 ~ 2021년 2월 5일",
    courseScheduleTime: [
      {
        time: "09:00 ~ 18:00",
        courseCost: [
          {
            cost: "0원",
            educationMethods: "오프라인",
          },
        ],
      },
    ],
  },
  courseDetailInformation: [
    {
      educationMethod: "오프라인\n(대면강의)",
      educationMethodDetail: [
        "비트교육센터 강의장에서 강의 진행",
        "서울시 서초구 서초대로 74길 33, 비트빌딩",
      ],
    },
  ],
  courseContents: [
    { contentsTitle: "  [1단계] : 데이터 과학 준비" },
    {
      day: "데이터 과학",
      contents: [
        "데이터 사이언스",
        "빅데이터 트렌드",
        "빅데이터와 활용",
      ],
    },
    {
      day: "서버 구축 및 네트워크 기본",
      contents: [
        "리눅스 서버 구축",
        "리눅스 명령어 숙지",
        "리눅스 네트워크 기본",
        "네트워크 및 시스템 보안",
      ],
    },
    {
      day: "빅데이터 시스템(하둡)기술이해",
      contents: [
        "하둡소개 및 설치",
        "하둡 에코시스트 이해",
        "Pig,Hive 프로그래밍 및 WordCount 실습",
        "실시간 처리 Spark 기술 이해",
      ],
    },
    {
      contentsTitle:
        "[2단계] : 데이터 처리를 위한 Tool",
    },
    {
      day: "자바 프로그래밍",
      contents: [
        "자바 개발 환경 소개/설치",
        "자바의 자료/연산자/조건문",
        "자바 Thread 프로그래밍",
        "자바 네트워크 프로그래밍",
      ],
    },
    {
      day: "비정형 데이터베이스",
      contents: [
        "NOSQL의 이해",
        "REDIS 이해 및 운영",
        "MongoDB 이해 및 운영",
      ],
    },
    {
      day: "파이썬",
      contents: [
        "파이썬 프로그래밍",
        "파이썬을 활용한 빅데이터 수집/분석/시각화",
        "Matplotlib,Numpy,Pandas,Scikit-learn",
      ],
    },
    {
      day: "텐서플로우",
      contents: [
        "텐서 플로우프로그램 설치",
        "텐서 플로우 라이브러리 프로그래밍",
        "텐서 플로우 머신러닝 프로그래밍 ",
      ],
    },
    {
      day: "미니프로젝트Ⅰ",
      contents: ["데이터 분석 및 시각화 표현"],
    },
    { contentsTitle: "[3단계] : 데이터 분석을 기방으로 AI 활용 솔루션 개발" },
    {
      day: "인공지능 기법이해",
      contents: ["머신러닝 이해(지도,비지도 학습)",
      "딥러닝 이해",
      "RNN,CNN등 알고리즘 이해", 
      "선형대수(경사하강도,..) 이해",
    ],
    },
    {
      day: "자연어처리",
      contents: [
        "자연어 처리 소개",
        "워드임베딩/트랜스포머 등 알고리즘 이해",
        "BERT 소개(KoBert)",
        "자연어 처리를 통한 챗봇/번역기 구성",
      ],
    },
    {
      day: "클라우드 플랫폼을 활용한 빅데이터 분석",
      contents: ["클라우드 플랫폼의 이해", "구글 클라우드 구성 및 빅퀘리 응용","아마존 AWS 활용한 클러스터 설정","아마존 AWS 데이터 처리 분석 툴 이해",],
    },
    {
      day: "미니프로젝트Ⅱ",
      contents: ["클라우드 플랫폼을 이용한 데이터 분석 예측설계"],
    },

    { contentsTitle: "[4단계] : 실무 프로젝트 구현" },
    {
      day: "실무 프로젝트",
      contents: [
        "4인 내외로 팀 구성",
        "주제 선정 후, 3개월 동안 프로젝트 수행, 개발 완료",
        "외부업체 관계자들의 참관 하에 최종 전시회 진행",
      ],
    },
  ],

  courseGuide: ["문의 : 비트교육센터 Tel. 02-3486-1780"],
  formUrl: "https://forms.gle/dhdfVy1NrdXHGf8f8",
};
