export default {
  courseTitle: { mainTitle: "Java Programming" },
  courseSubTitle: "자바로 시작하는 객체지향 프로그래밍 입문",
  courseGoal: [
    "자바 프로그램을 객체지향적으로 만드는 방법에 대해서 학습하여 설명할 수 있다.",
    "자료구조에 대해서 이해하고 자바를 이용해 이를 직접 구현해보며 Collection 프레임워크를 적절히 활용할 수 있다.",
    "입출력 프로그램에 대해서 이해하고 java.io 패키지로 제공되는 다양한 입출력 클래스의 특징을 설명할 수 있다.",
    "스레드를 이해하고 실무에 적용할 수 있다.",
    "네트워크에 대해서 이해하고 에코서버 및 채팅서버 프로그램을 작성할 수 있다.",
  ],
  courseTarget: [
    {
      targetTitle: "전 세계에서 가장 많은 사용자를 보유한 언어, JAVA",
      targetDescription: [
        "자바 언어는 프로그래밍 언어 중 세계 1위를 기록하고 있는 객체지향 언어이며, 우리나라 웹 개발들이 채택하고 있는 주용 언어 중 하나이며, 모바일 OS 점유율 1위를 기록하고 있는 안드로이드 OS의 공식 개발 언어입니다.",
      ],
    },
    {
      targetTitle: "자바를 공부하면...",
      targetDescription: [
        "객체지향 프로그래밍의 원리를 이해하고 이에 따라 소프트웨어를 구현할 수 있습니다.",
        "안드로이드 OS에서 동작하는 모바일 애플리케이션을 개발할 수 있습니다.",
        "자바 언어를 기반으로 동작하는 인터넷, 네트워크의 동작 원리를 이해하고 기초를 튼튼히 할 수 있습니다.",
        "자바 언어로 본인이 원하는 소프트웨어를 직접 구현할 수 있습니다.",
        "네트워크를 이해하고 에코 서버 및 채팅 서버 프로그래밍을 작성할 수 있습니다.",
      ],
    },
  ],
  courseSchedules: {
    term: "2020.07.06.월 ~ 07.30.목",
    courseScheduleTime: [
      {
        time: "10:00 ~ 13:00",
        courseCost: [
          {
            cost: "320,000원",
            educationMethods: "오프라인",
          },
          {
            cost: "200,000원",
            educationMethods: "온라인",
          },
        ],
      },
      {
        time: "19:00 ~ 22:00",
        courseCost: [
          {
            cost: "320,000원",
            educationMethods: "오프라인",
          },
        ],
      },
    ],
  },
  courseDetailInformation: [
    {
      educationMethod: "오프라인(대면강의)",
      educationMethodDetail: [
        "비트교육센터 강의장에서 강의 진행",
        "서울시 서초구 서초대로 74길 33, 비트빌딩 3층",
      ],
    },
    {
      educationMethod: "온라인(비대면강의)",
      educationMethodDetail: [
        "수업운영 플랫폼(Zoom)을 활용한 온라인 강의",
        "수업교재 제공",
        "4+1 요일제 운영 : 매주 온라인 교육 (월~목), 오프라인 질의응답 미팅 진행 (금)",
        "오프라인 질의응답 미팅은 매주 금요일 10:00 ~ 13:00 에 운영",
        "강의 참여방법 : 단톡방을 개설 후 수업진행 코드를 링크(공유)",
        "개인 노트북/PC 필수",
      ],
    },
  ],
  courseContents: [
    {
      day: "1일",
      contents: [
        "자바 입문",
        "자바 소개 / 설치",
        "자바 개발환경 소개 / 설치",
        "git 소개 / 사용법",
        "자바 애플리케이션 작성",
        "자바 애플리케이션 실행과 원리",
        "JVM 애플리케이션 실행과 원리",
        "JVM 소개 및 메모리 모델",
        "[과제 : Github 사용법 및 연습]",
      ],
    },
    {
      day: "2일",
      contents: [
        "기본프로그래밍",
        "식별자와 예약어, 변수와 상수, 자바의 자료형, 자료형의 변환",
        "연산자, 조건문, 반복문, 배열",
      ],
    },
    {
      day: "3일",
      contents: [
        "[코드리뷰 1, 2, 3]",
        "기본 프로그래밍",
        "[과제 : 기본 프로그래밍 연습2, 기본 프로그래밍 연습3]",
      ],
    },
    {
      day: "4일",
      contents: [
        "객체지향 프로그래밍 주요 개념",
        "도서 대여점",
        "UML 소개 및 기초",
      ],
    },
    {
      day: "5일",
      contents: [
        "객체지향 프로그래밍 시작하기",
        "객체지향 프로그래밍 소개",
        "객체와 클래스",
      ],
    },
    {
      day: "6일",
      contents: ["클래스의 다형성", "클래스의 정의", "다형성(오버로딩)"],
    },
    {
      day: "7일",
      contents: [
        "상속과 다형성",
        "상속이란 ?",
        "상속과 생성자",
        "상속과 다형성 (오버라이딩)",
      ],
    },
    {
      day: "8일",
      contents: [
        "추상 클래스와 인터페이스",
        "추상 클래스 선언과 상속",
        "인터페이스 선언과 구현 및 상속",
      ],
    },
    {
      day: "9일",
      contents: [
        "예외 처리",
        "예외처리란?",
        "예외처리 방법",
        "예외 종류",
        "예외 처리 문제점과 개선",
      ],
    },
    {
      day: "10일",
      contents: [
        "언어와 시스템 API",
        "Object 클래스와 오버라이딩",
        "String, Wrapper 클래스와 JVM 상수풀",
        "인스탄스 아이디",
        "자바 관례로 작동하는 내부코드",
      ],
    },
    {
      day: "11일",
      contents: [
        "콜렉션 프레임워크",
        "콜렉션 프레임워크 구조",
        "콜렉션 프레임워크 안의 인터페이스와 제네릭",
        "자료구조 개요",
        "자바 콜렉션 프레임워크 흉내 내기",
      ],
    },
    {
      day: "12일",
      contents: [
        "스트림과 자바IO",
        "객체지향에서의 추상화 개념 리뷰",
        "디자인 패턴 기초",
        "자바 IO 패키지와 데코레이션 패턴",
        "주스트림과 보조스트림의 효과적 사용과 설계개념 이해",
      ],
    },
    {
      day: "13일",
      contents: [
        "자바 쓰레드",
        "쓰레드 개념",
        "자바 쓰레드 구현하기",
        "자바 병렬 프로그래밍",
        "리액티브 소개",
      ],
    },
    {
      day: "14일",
      contents: [
        "네트워크 프로그래밍 1",
        "네트워크 프리미어",
        "소켓 프로그래밍 이해",
        "자바 TCP/IP 소켓 프로그래밍 기초",
      ],
    },
    {
      day: "15일",
      contents: [
        "네트워크 프로그래밍 2",
        "쓰레드 적용한 다중처리 서버 작성",
        "HTTP 이해하기",
        "웹 서버 작성하기",
        "자바 GUI 프로그래밍 기초",
      ],
    },
    {
      day: "16일",
      contents: ["채팅 서버 / 클라이언트 작성"],
    },
  ],

  courseGuide: ["문의 : 비트교육센터 Tel. 02-3486-1780"],
  formUrl:
    "https://docs.google.com/forms/d/1HLO7Z-H5w7AXiTnVS56U-Ffj55XBuo4_v_zWp4eRXzk/edit",
};
